In [30]:
import pymongo as pm

In [31]:
myclient = pm.MongoClient('localhost',27017)
mydb = myclient["mydatabase"]

In [32]:
mycol = mydb["customers"]

In [33]:
mylist = [
    {"name":"Amy","adress":"Apple st 652"},
    {"name":"Hannah","adress":"Mountain 21"},
    {"name":"Michael","adress":"Valley 345"},
    {"name":"Sandy","adress":"Ocean blvd 2"},
    {"name":"Betty","adress":"Green Grass 1"},
    {"name":"Richard","adress":"Sky st 331"},
    {"name":"Susan","adress":"One way 98"},
    {"name":"Vicky","adress":"Yellow garden 2"},
    {"name":"Ben","adress":"Park Lane 38"},
    {"name":"William","adress":"Central st 954"},
    {"name":"Chuck","adress":"Main Road 989"},
    {"name":"Viola","adress":"Sideway 1633"}
]

x = mycol.insert_many(mylist)

In [36]:
print(mydb.list_collection_names())

['customers']

In [39]:
mydict = {"name":"John","adress":"Highway 37"}
x = mycol.insert_one(mydict)
print(x.inserted_id)

5c7abffa4b54de16c97a8763

In [42]:
for x in mycol.find():
 print(x)

{'_id': ObjectId('5c7abe904b54de16c97a873c'), 'name': 'Amy', 'adress': 'Apple st 652'}
{'_id': ObjectId('5c7abe904b54de16c97a873d'), 'name': 'Hannah', 'adress': 'Mountain 21'}
{'_id': ObjectId('5c7abe904b54de16c97a873e'), 'name': 'Michael', 'adress': 'Valley 345'}
{'_id': ObjectId('5c7abe904b54de16c97a873f'), 'name': 'Sandy', 'adress': 'Ocean blvd 2'}
{'_id': ObjectId('5c7abe904b54de16c97a8740'), 'name': 'Betty', 'adress': 'Green Grass 1'}
{'_id': ObjectId('5c7abe904b54de16c97a8741'), 'name': 'Richard', 'adress': 'Sky st 331'}
{'_id': ObjectId('5c7abe904b54de16c97a8742'), 'name': 'Susan', 'adress': 'One way 98'}
{'_id': ObjectId('5c7abe904b54de16c97a8743'), 'name': 'Vicky', 'adress': 'Yellow garden 2'}
{'_id': ObjectId('5c7abe904b54de16c97a8744'), 'name': 'Ben', 'adress': 'Park Lane 38'}
{'_id': ObjectId('5c7abe904b54de16c97a8745'), 'name': 'William', 'adress': 'Central st 954'}
{'_id': ObjectId('5c7abe904b54de16c97a8746'), 'name': 'Chuck', 'adress': 'Main Road 989'}
{'_id': ObjectId('5c7abe904b54de16c97a8747'), 'name': 'Viola', 'adress': 'Sideway 1633'}
{'_id': ObjectId('5c7abe9e4b54de16c97a8748'), 'name': 'Amy', 'adress': 'Apple st 652'}
{'_id': ObjectId('5c7abe9e4b54de16c97a8749'), 'name': 'Hannah', 'adress': 'Mountain 21'}
{'_id': ObjectId('5c7abe9e4b54de16c97a874a'), 'name': 'Michael', 'adress': 'Valley 345'}
{'_id': ObjectId('5c7abe9e4b54de16c97a874b'), 'name': 'Sandy', 'adress': 'Ocean blvd 2'}
{'_id': ObjectId('5c7abe9e4b54de16c97a874c'), 'name': 'Betty', 'adress': 'Green Grass 1'}
{'_id': ObjectId('5c7abe9e4b54de16c97a874d'), 'name': 'Richard', 'adress': 'Sky st 331'}
{'_id': ObjectId('5c7abe9e4b54de16c97a874e'), 'name': 'Susan', 'adress': 'One way 98'}
{'_id': ObjectId('5c7abe9e4b54de16c97a874f'), 'name': 'Vicky', 'adress': 'Yellow garden 2'}
{'_id': ObjectId('5c7abe9e4b54de16c97a8750'), 'name': 'Ben', 'adress': 'Park Lane 38'}
{'_id': ObjectId('5c7abe9e4b54de16c97a8751'), 'name': 'William', 'adress': 'Central st 954'}
{'_id': ObjectId('5c7abe9e4b54de16c97a8752'), 'name': 'Chuck', 'adress': 'Main Road 989'}
{'_id': ObjectId('5c7abe9e4b54de16c97a8753'), 'name': 'Viola', 'adress': 'Sideway 1633'}
{'_id': ObjectId('5c7abf194b54de16c97a8755'), 'name': 'Amy', 'adress': 'Apple st 652'}
{'_id': ObjectId('5c7abf194b54de16c97a8756'), 'name': 'Hannah', 'adress': 'Mountain 21'}
{'_id': ObjectId('5c7abf194b54de16c97a8757'), 'name': 'Michael', 'adress': 'Valley 345'}
{'_id': ObjectId('5c7abf194b54de16c97a8758'), 'name': 'Sandy', 'adress': 'Ocean blvd 2'}
{'_id': ObjectId('5c7abf194b54de16c97a8759'), 'name': 'Betty', 'adress': 'Green Grass 1'}
{'_id': ObjectId('5c7abf194b54de16c97a875a'), 'name': 'Richard', 'adress': 'Sky st 331'}
{'_id': ObjectId('5c7abf194b54de16c97a875b'), 'name': 'Susan', 'adress': 'One way 98'}
{'_id': ObjectId('5c7abf194b54de16c97a875c'), 'name': 'Vicky', 'adress': 'Yellow garden 2'}
{'_id': ObjectId('5c7abf194b54de16c97a875d'), 'name': 'Ben', 'adress': 'Park Lane 38'}
{'_id': ObjectId('5c7abf194b54de16c97a875e'), 'name': 'William', 'adress': 'Central st 954'}
{'_id': ObjectId('5c7abf194b54de16c97a875f'), 'name': 'Chuck', 'adress': 'Main Road 989'}
{'_id': ObjectId('5c7abf194b54de16c97a8760'), 'name': 'Viola', 'adress': 'Sideway 1633'}
{'_id': ObjectId('5c7abfce4b54de16c97a8761'), 'name': 'John', 'adress': 'Highway 37'}
{'_id': ObjectId('5c7abfec4b54de16c97a8762'), 'name': 'John', 'adress': 'Highway 37'}
{'_id': ObjectId('5c7abffa4b54de16c97a8763'), 'name': 'John', 'adress': 'Highway 37'}

In [51]:
for x in mycol.find({},{"_id":0, "name":1, "adress":1}):
    print(x)

{'name': 'Amy', 'adress': 'Apple st 652'}
{'name': 'Hannah', 'adress': 'Mountain 21'}
{'name': 'Michael', 'adress': 'Valley 345'}
{'name': 'Sandy', 'adress': 'Ocean blvd 2'}
{'name': 'Betty', 'adress': 'Green Grass 1'}
{'name': 'Richard', 'adress': 'Sky st 331'}
{'name': 'Susan', 'adress': 'One way 98'}
{'name': 'Vicky', 'adress': 'Yellow garden 2'}
{'name': 'Ben', 'adress': 'Park Lane 38'}
{'name': 'William', 'adress': 'Central st 954'}
{'name': 'Chuck', 'adress': 'Main Road 989'}
{'name': 'Viola', 'adress': 'Sideway 1633'}
{'name': 'Amy', 'adress': 'Apple st 652'}
{'name': 'Hannah', 'adress': 'Mountain 21'}
{'name': 'Michael', 'adress': 'Valley 345'}
{'name': 'Sandy', 'adress': 'Ocean blvd 2'}
{'name': 'Betty', 'adress': 'Green Grass 1'}
{'name': 'Richard', 'adress': 'Sky st 331'}
{'name': 'Susan', 'adress': 'One way 98'}
{'name': 'Vicky', 'adress': 'Yellow garden 2'}
{'name': 'Ben', 'adress': 'Park Lane 38'}
{'name': 'William', 'adress': 'Central st 954'}
{'name': 'Chuck', 'adress': 'Main Road 989'}
{'name': 'Viola', 'adress': 'Sideway 1633'}
{'name': 'Amy', 'adress': 'Apple st 652'}
{'name': 'Hannah', 'adress': 'Mountain 21'}
{'name': 'Michael', 'adress': 'Valley 345'}
{'name': 'Sandy', 'adress': 'Ocean blvd 2'}
{'name': 'Betty', 'adress': 'Green Grass 1'}
{'name': 'Richard', 'adress': 'Sky st 331'}
{'name': 'Susan', 'adress': 'One way 98'}
{'name': 'Vicky', 'adress': 'Yellow garden 2'}
{'name': 'Ben', 'adress': 'Park Lane 38'}
{'name': 'William', 'adress': 'Central st 954'}
{'name': 'Chuck', 'adress': 'Main Road 989'}
{'name': 'Viola', 'adress': 'Sideway 1633'}
{'name': 'John', 'adress': 'Highway 37'}
{'name': 'John', 'adress': 'Highway 37'}
{'name': 'John', 'adress': 'Highway 37'}

In [53]:
myquery = {"adress":"Park Lane 38"}
mydoc = mycol.find(myquery)

for x in mydoc:
    print(x)

{'_id': ObjectId('5c7abe904b54de16c97a8744'), 'name': 'Ben', 'adress': 'Park Lane 38'}
{'_id': ObjectId('5c7abe9e4b54de16c97a8750'), 'name': 'Ben', 'adress': 'Park Lane 38'}
{'_id': ObjectId('5c7abf194b54de16c97a875d'), 'name': 'Ben', 'adress': 'Park Lane 38'}

In [54]:
import pandas as pd

In [57]:
datos = pd.read_excel("todoslosmeses.xlsx")

In [61]:
datos.head()

       hora      fecha  coedisp  abso    albedo  extinc        cn
0  00:02:00 2017-01-01     19.2  3.51  0.845443   22.71  0.746809
1  00:03:00 2017-01-01     18.8  3.59  0.839661   22.39  0.763830
2  00:04:00 2017-01-01     25.8  4.03  0.864901   29.83  0.857447
3  00:05:00 2017-01-01     20.3  3.82  0.841625   24.12  0.812766
4  00:06:00 2017-01-01     19.7  3.94  0.833333   23.64  0.838298

In [62]:
datos.tail()

            hora      fecha  coedisp  abso    albedo  extinc        cn
241949  23:56:00 2017-06-30    1.430  2.08  0.407407   3.510  0.442553
241950  23:57:00 2017-06-30    0.681  1.80  0.274486   2.481  0.382979
241951  23:58:00 2017-06-30    1.560  2.08  0.428571   3.640  0.442553
241952  23:59:00 2017-06-30    2.060  1.96  0.512438   4.020  0.417021
241953  23:59:55 2017-06-30    1.990  1.83  0.520942   3.820  0.389362

In [64]:
datos.columns

Index(['hora', 'fecha', 'coedisp', 'abso', 'albedo', 'extinc', 'cn'], dtype='object')

In [66]:
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 241954 entries, 0 to 241953
Data columns (total 7 columns):
hora       241954 non-null object
fecha      241954 non-null datetime64[ns]
coedisp    240958 non-null float64
abso       228263 non-null float64
albedo     227617 non-null float64
extinc     227617 non-null float64
cn         228263 non-null float64
dtypes: datetime64[ns](1), float64(5), object(1)
memory usage: 12.9+ MB

In [74]:
datos.columns.str.lower()
datos.columns

Index(['hora', 'fecha', 'coedisp', 'abso', 'albedo', 'extinc', 'cn'], dtype='object')

In [75]:
datos2 = datos.head(3)
datos2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
hora       3 non-null object
fecha      3 non-null datetime64[ns]
coedisp    3 non-null float64
abso       3 non-null float64
albedo     3 non-null float64
extinc     3 non-null float64
cn         3 non-null float64
dtypes: datetime64[ns](1), float64(5), object(1)
memory usage: 248.0+ bytes

In [76]:
datos["fecha"].head()

0   2017-01-01
1   2017-01-01
2   2017-01-01
3   2017-01-01
4   2017-01-01
Name: fecha, dtype: datetime64[ns]

In [78]:
datos[20:25]

        hora      fecha  coedisp  abso    albedo  extinc        cn
20  00:23:00 2017-01-01     15.0  2.72  0.846501   17.72  0.578723
21  00:24:00 2017-01-01     18.7  2.91  0.865340   21.61  0.619149
22  00:25:00 2017-01-01     19.7  2.68  0.880250   22.38  0.570213
23  00:26:00 2017-01-01     15.6  1.97  0.887877   17.57  0.419149
24  00:27:00 2017-01-01     17.2  2.49  0.873540   19.69  0.529787

In [82]:
datos[datos["fecha"] == "2017/06/05"].head()

            hora      fecha  coedisp  abso    albedo  extinc        cn
206999  00:02:00 2017-06-05    14.40  3.04  0.825688   17.44  0.646809
207000  00:03:00 2017-06-05    11.40  3.12  0.785124   14.52  0.663830
207001  00:04:00 2017-06-05    11.30  2.83  0.799717   14.13  0.602128
207002  00:05:00 2017-06-05     8.74  2.51  0.776889   11.25  0.534043
207003  00:06:00 2017-06-05    11.00  2.95  0.788530   13.95  0.627660

In [84]:
datos[pd.isna(datos.albedo)].head()

         hora      fecha  coedisp  abso  albedo  extinc  cn
675  12:05:00 2017-01-01    12.90   NaN     NaN     NaN NaN
676  12:06:00 2017-01-01     5.67   NaN     NaN     NaN NaN
677  12:07:00 2017-01-01     6.47   NaN     NaN     NaN NaN
678  12:08:00 2017-01-01     6.71   NaN     NaN     NaN NaN
679  12:09:00 2017-01-01     6.67   NaN     NaN     NaN NaN